Revit 2024 API
StairsLanding.CanCreateAutomaticLanding Method
 Checks whether automatic landing(s) can be created between the given two stairs runs and logically join(s) with the stairs runs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool CanCreateAutomaticLanding(
	Document document,
	ElementId firstRunId,
	ElementId secondRunId
)
Visual Basic
Public Shared Function CanCreateAutomaticLanding ( _
	document As Document, _
	firstRunId As ElementId, _
	secondRunId As ElementId _
) As Boolean
Visual C++
public:
static bool CanCreateAutomaticLanding(
	Document^ document,
	ElementId^ firstRunId,
	ElementId^ secondRunId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document that owns the stairs runs.
firstRunId
Type: Autodesk.Revit.DB.ElementId
 The first stairs run.
secondRunId
Type: Autodesk.Revit.DB.ElementId
 The second stairs run.
Return Value
 True if automatic landing(s) can be created between the two stairs runs, False otherwise.
Remarks
 This only checks whether two stairs runs meet restriction to create automatic landing(s) without checking the stairs edit scope and document modifiable.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace